In [33]:
import pandas as pd
import numpy as np

# Load the dataset
df = pd.read_csv("train.csv")

Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task.

In [34]:
# Helper function to extract numeric part from strings
def extract_numeric(series):
    return pd.to_numeric(series.str.extract(r'([\d.]+)')[0], errors='coerce')

# Clean and convert string columns with units to numeric
df['Mileage'] = extract_numeric(df['Mileage'])
df['Engine'] = extract_numeric(df['Engine'])
df['Power'] = extract_numeric(df['Power'])

# Impute missing values
df['Mileage'].fillna(df['Mileage'].median(), inplace=True)
df['Engine'].fillna(df['Engine'].median(), inplace=True)
df['Power'].fillna(df['Power'].median(), inplace=True)
df['Seats'].fillna(df['Seats'].mode()[0], inplace=True)


# Final check for any remaining missing values
print("Total missing values:", df.isnull().sum().sum())

Total missing values: 5032

<ipython-input-34-3a7589b20ef4>:11: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Mileage'].fillna(df['Mileage'].median(), inplace=True)
<ipython-input-34-3a7589b20ef4>:12: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Engine'].fillna(df['Engine'].median(), inplace=True)
<ipython-input-34-3a7589b20ef4>:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Power'].fillna(df['Power'].median(), inplace=True)
<ipython-input-34-3a7589b20ef4>:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Seats'].fillna(df['Seats'].mode()[0], inplace=True)

b) Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from “New_price”)

In [35]:
def extract_numeric(series):
    return series.astype(str).str.extract(r'(\d+\.?\d*)')[0].astype(float)

In [36]:
def extract_numeric(series):
    return series.apply(lambda x: float(str(x).split()[0]) if pd.notnull(x) and str(x).strip() != '' else None)

In [37]:
df['Mileage'] = extract_numeric(df['Mileage'])
df['Engine'] = extract_numeric(df['Engine'])
df['Power'] = extract_numeric(df['Power'])
df['New_Price'] = df['New_Price'].str.replace(' Lakh', '', regex=False)
df['New_Price'] = pd.to_numeric(df['New_Price'], errors='coerce') * 100000  # Convert lakh to rupees

In [38]:
print(df.columns.tolist())

['Unnamed: 0', 'Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type', 'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'New_Price', 'Price']

C) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.

In [39]:
# One-hot encode categorical variables
df = pd.get_dummies(df, columns=['Fuel_Type', 'Transmission'], drop_first=True)

# Check result
print(df.head())

   Unnamed: 0                              Name    Location  Year  \
0           1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1           2                      Honda Jazz V     Chennai  2011
2           3                 Maruti Ertiga VDI     Chennai  2012
3           4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4           6            Nissan Micra Diesel XV      Jaipur  2013

   Kilometers_Driven Owner_Type  Mileage  Engine   Power  Seats  New_Price  \
0              41000      First    19.67  1582.0  126.20    5.0        NaN
1              46000      First    13.00  1199.0   88.70    5.0   861000.0
2              87000      First    20.77  1248.0   88.76    7.0        NaN
3              40670     Second    15.20  1968.0  140.80    5.0        NaN
4              86999      First    23.08  1461.0   63.10    5.0        NaN

   Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual
0  12.50               False             False                 True
1   4.50               False              True                 True
2   6.00               False             False                 True
3  17.74               False             False                False
4   3.50               False             False                 True

In [44]:
from datetime import datetime

# Get current year
current_year = datetime.now().year

# Add Car_Age to the cleaned dataframe
df['Car_Age'] = current_year - df['Year']

# Display result
print(df[['Car_Age']].head())

   Car_Age
0       10
1       14
2       13
3       12
4       12

E) Perform select, filter, rename, mutate, arrange and summarize with group by operations (or
their equivalent operations in python) on this dataset.

In [46]:
# Select
df_selected = df[['Owner_Type', 'Price', 'Mileage']]

# Filter
df_filtered = df[df['Mileage'] > 25]

# Rename
df_renamed = df.rename(columns={'Owner_Type': 'Brand', 'Price': 'Car_Price'})

# Mutate
df['Power_kW'] = df['Power'] * 0.7457

# Arrange
df_sorted = df.sort_values(by='Price', ascending=False)

# Group by and summarize
df_summary = df.groupby('Owner_Type')['Mileage'].mean().reset_index()

df_summary_multi = df.groupby('Owner_Type').agg(
    total_price=('Price', 'sum'),
    avg_mileage=('Mileage', 'mean'),
    max_power=('Power', 'max')
).reset_index()

# Show final results
print("Selected Data:")
print(df_selected)
print("\nFiltered Data:")
print(df_filtered)
print("\nRenamed Data:")
print(df_renamed)
print("\nSorted Data:")
print(df_sorted)
print("\nGrouped and Summarized Data:")
print(df_summary_multi)

Selected Data:
     Owner_Type  Price  Mileage
0         First  12.50    19.67
1         First   4.50    13.00
2         First   6.00    20.77
3        Second  17.74    15.20
4         First   3.50    23.08
...         ...    ...      ...
5842      First   4.75    28.40
5843      First   4.00    24.40
5844     Second   2.90    14.00
5845      First   2.65    18.90
5846      First   2.50    25.44

[5847 rows x 3 columns]

Filtered Data:
      Unnamed: 0                                       Name    Location  Year  \
10            12                      Maruti Swift VDI BSIV      Jaipur  2015
14            16                      Honda Amaze S i-Dtech       Kochi  2016
15            17                      Maruti Swift DDiS VDI      Jaipur  2017
39            41                            Tata Nano LX SE       Kochi  2014
40            42  Mahindra KUV 100 mFALCON D75 K8 Dual Tone  Coimbatore  2017
...          ...                                        ...         ...   ...
5772        5941                           Renault KWID RXL        Pune  2018
5788        5958                      Honda Amaze S i-Dtech      Jaipur  2015
5841        6013                      Honda Amaze VX i-DTEC  Coimbatore  2015
5842        6014                           Maruti Swift VDI       Delhi  2014
5846        6018                      Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  New_Price  \
10                64424      First    25.20  1248.0   74.0    5.0        NaN
14                58950      First    25.80  1498.0   98.6    5.0        NaN
15                25000      First    28.40  1248.0   74.0    5.0        NaN
39                19698      First    25.40   624.0   37.5    4.0        NaN
40                22033      First    25.32  1198.0   77.0    6.0        NaN
...                 ...        ...      ...     ...    ...    ...        ...
5772               1000      First    25.17   799.0   53.3    5.0   445000.0
5788              91000      First    25.80  1498.0   98.6    5.0        NaN
5841              70602      First    25.80  1498.0   98.6    5.0        NaN
5842              27365      First    28.40  1248.0   74.0    5.0   788000.0
5846              47000      First    25.44   936.0   57.6    5.0        NaN

      Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  \
10     5.60               False             False                 True
14     5.40               False             False                 True
15     5.99               False             False                 True
39     1.53               False              True                 True
40     5.58               False             False                 True
...     ...                 ...               ...                  ...
5772   3.40               False              True                 True
5788   4.68               False             False                 True
5841   4.83               False             False                 True
5842   4.75               False             False                 True
5846   2.50               False             False                 True

      Car_Age
10         10
14          9
15          8
39         11
40          8
...       ...
5772        7
5788       10
5841       10
5842       11
5846       14

[384 rows x 16 columns]

Renamed Data:
      Unnamed: 0                              Name    Location  Year  \
0              1  Hyundai Creta 1.6 CRDi SX Option        Pune  2015
1              2                      Honda Jazz V     Chennai  2011
2              3                 Maruti Ertiga VDI     Chennai  2012
3              4   Audi A4 New 2.0 TDI Multitronic  Coimbatore  2013
4              6            Nissan Micra Diesel XV      Jaipur  2013
...          ...                               ...         ...   ...
5842        6014                  Maruti Swift VDI       Delhi  2014
5843        6015          Hyundai Xcent 1.1 CRDi S      Jaipur  2015
5844        6016             Mahindra Xylo D4 BSIV      Jaipur  2012
5845        6017                Maruti Wagon R VXI     Kolkata  2013
5846        6018             Chevrolet Beat Diesel   Hyderabad  2011

      Kilometers_Driven   Brand  Mileage  Engine   Power  Seats  New_Price  \
0                 41000   First    19.67  1582.0  126.20    5.0        NaN
1                 46000   First    13.00  1199.0   88.70    5.0   861000.0
2                 87000   First    20.77  1248.0   88.76    7.0        NaN
3                 40670  Second    15.20  1968.0  140.80    5.0        NaN
4                 86999   First    23.08  1461.0   63.10    5.0        NaN
...                 ...     ...      ...     ...     ...    ...        ...
5842              27365   First    28.40  1248.0   74.00    5.0   788000.0
5843             100000   First    24.40  1120.0   71.00    5.0        NaN
5844              55000  Second    14.00  2498.0  112.00    8.0        NaN
5845              46000   First    18.90   998.0   67.10    5.0        NaN
5846              47000   First    25.44   936.0   57.60    5.0        NaN

      Car_Price  Fuel_Type_Electric  Fuel_Type_Petrol  Transmission_Manual  \
0         12.50               False             False                 True
1          4.50               False              True                 True
2          6.00               False             False                 True
3         17.74               False             False                False
4          3.50               False             False                 True
...         ...                 ...               ...                  ...
5842       4.75               False             False                 True
5843       4.00               False             False                 True
5844       2.90               False             False                 True
5845       2.65               False              True                 True
5846       2.50               False             False                 True

      Car_Age
0          10
1          14
2          13
3          12
4          12
...       ...
5842       11
5843       10
5844       13
5845       12
5846       14

[5847 rows x 16 columns]

Sorted Data:
      Unnamed: 0                                         Name    Location  \
3952        4079  Land Rover Range Rover 3.0 Diesel LWB Vogue   Hyderabad
5620        5781                   Lamborghini Gallardo Coupe       Delhi
5752        5919                       Jaguar F Type 5.0 V8 S   Hyderabad
1457        1505              Land Rover Range Rover Sport SE       Kochi
1917        1974                           BMW 7 Series 740Li  Coimbatore
...          ...                                          ...         ...
3127        3228                               Maruti 800 Std        Pune
2758        2847                             Hyundai Getz GLS        Pune
3039        3138                               Maruti Zen LXI      Jaipur
1577        1628                         Maruti 800 Std BSIII      Jaipur
1660        1713                                 Tata Nano Lx        Pune

      Year  Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  \
3952  2017              25000      First    13.33  2993.0  255.0    5.0
5620  2011               6500      Third     6.40  5204.0  560.0    2.0
5752  2015               8000      First    12.50  5000.0  488.1    2.0
1457  2019              26013      First    12.65  2993.0  255.0    5.0
1917  2018              28060      First    12.05  2979.0  320.0    5.0
...    ...                ...        ...      ...     ...    ...    ...
3127  2003              52000      First    16.10   796.0   37.0    4.0
2758  2005              86000     Second    15.30  1341.0   83.0    5.0
3039  1998              95150      Third    17.30   993.0   60.0    5.0
1577  2004              12000     Second    16.10   796.0   37.0    4.0
1660  2011              65000     Second    26.00   624.0   35.0    4.0

      New_Price   Price  Fuel_Type_Electric  Fuel_Type_Petrol  \
3952        NaN  160.00               False             False
5620        NaN  120.00               False              True
5752        NaN  100.00               False              True
1457        NaN   97.07               False             False
1917        NaN   93.67               False              True
...         ...     ...                 ...               ...
3127        NaN    0.50               False              True
2758        NaN    0.45               False              True
3039        NaN    0.45               False              True
1577        NaN    0.45               False              True
1660        NaN    0.44               False              True

      Transmission_Manual  Car_Age   Power_kW
3952                False        8  190.15350
5620                False       14  417.59200
5752                False       10  363.97617
1457                False        6  190.15350
1917                False        7  238.62400
...                   ...      ...        ...
3127                 True       22   27.59090
2758                 True       20   61.89310
3039                 True       27   44.74200
1577                 True       21   27.59090
1660                 True       14   26.09950

[5847 rows x 17 columns]

Grouped and Summarized Data:
       Owner_Type  total_price  avg_mileage  max_power
0           First     48615.52    18.454201      552.0
1  Fourth & Above        27.32    13.862500      163.5
2          Second      7251.74    16.914411      550.0
3           Third       550.85    15.853398      560.0